#Дано натуральное число. Выведите его последнюю цифру.
#Формат ввода
#Вводится единственное целое положительное число (гарантируется, что оно не превышает 10000).
#Формат вывода
#Выведите ответ на задачу.

a = int(input())
print(a % 10)
